In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'subha'],
    "mark":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'barelly','balasore']
}

## Convert the given dictionary in to dataframe

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## Convert the dataframe into csv file or any type of file i.e. Excel file

In [5]:
df.to_csv('friend.csv')

In [6]:
df.to_csv('friend_indexFalse.csv', index=False)

In [7]:
df.head(2) # To show first two rows

    name  mark     city
0  harry    92   rampur
1  rohan    34  kolkata

In [8]:
df.tail(2) # To show last two rows

     name  mark      city
2  skillf    24   barelly
3   subha    17  balasore

In [9]:
df.describe() # To describe the numerical values of the data set

           mark
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
df

     name  mark      city
0   harry    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## To change a content in the csv file

In [11]:
df['name'][0] = 'Bubu'

C:\Users\mebub_9a7jdi8\AppData\Local\Temp\ipykernel_13940\2341372380.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][0] = 'Bubu'

In [12]:
df

     name  mark      city
0    Bubu    92    rampur
1   rohan    34   kolkata
2  skillf    24   barelly
3   subha    17  balasore

## To change the Index number

In [13]:
df.index = ['first', 'second', 'third', 'fourth']

In [14]:
df

          name  mark      city
first     Bubu    92    rampur
second   rohan    34   kolkata
third   skillf    24   barelly
fourth   subha    17  balasore

## How to print a series

In [15]:
ser = pd.Series(np.random.rand(34))

In [16]:
ser

0     0.690095
1     0.227613
2     0.350539
3     0.117230
4     0.322938
5     0.813890
6     0.131341
7     0.316943
8     0.864484
9     0.660503
10    0.763900
11    0.286641
12    0.107257
13    0.493299
14    0.070296
15    0.321319
16    0.152302
17    0.808941
18    0.320555
19    0.936568
20    0.242553
21    0.854090
22    0.224487
23    0.288749
24    0.595783
25    0.192128
26    0.022976
27    0.282648
28    0.287768
29    0.522569
30    0.839231
31    0.005605
32    0.093470
33    0.360104
dtype: float64

In [17]:
type (ser)

pandas.core.series.Series

## To make a new dataframe

In [18]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [19]:
newdf.head()

          0         1         2         3         4
0  0.631012  0.851450  0.285129  0.900926  0.024145
1  0.550210  0.629512  0.236064  0.184234  0.526038
2  0.121892  0.382033  0.727544  0.829313  0.970934
3  0.930691  0.826131  0.379705  0.308187  0.583943
4  0.298736  0.347746  0.718525  0.606627  0.120785

In [20]:
type(newdf)

pandas.core.frame.DataFrame

## To change the dara type

In [21]:
# newdf[0][0] = "bubu"

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.head()

          0         1         2         3         4
0  0.631012  0.851450  0.285129  0.900926  0.024145
1  0.550210  0.629512  0.236064  0.184234  0.526038
2  0.121892  0.382033  0.727544  0.829313  0.970934
3  0.930691  0.826131  0.379705  0.308187  0.583943
4  0.298736  0.347746  0.718525  0.606627  0.120785

In [24]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

## How to convert a dataframe into numpy arrays

In [25]:
newdf.to_numpy()

array([[0.63101184, 0.85145028, 0.28512871, 0.90092599, 0.02414539],
       [0.55020955, 0.62951154, 0.2360641 , 0.1842342 , 0.5260381 ],
       [0.12189214, 0.3820329 , 0.72754395, 0.8293134 , 0.97093354],
       ...,
       [0.49331996, 0.92279158, 0.80042847, 0.49070019, 0.37503791],
       [0.46953109, 0.29109375, 0.59218138, 0.17137316, 0.88497782],
       [0.15858295, 0.92459471, 0.64500935, 0.07608528, 0.20676465]])

## Transpose (convert rows into columns and vice versa)

In [26]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.631012,0.550210,0.121892,0.930691,0.298736,0.946237,0.082162,0.918051,0.403898,0.133871,...,0.226857,0.966242,0.121785,0.954474,0.681083,0.460582,0.682081,0.493320,0.469531,0.158583
1,0.851450,0.629512,0.382033,0.826131,0.347746,0.666547,0.905739,0.573137,0.345552,0.628800,...,0.454521,0.081152,0.898896,0.262667,0.612348,0.068399,0.923336,0.922792,0.291094,0.924595
2,0.285129,0.236064,0.727544,0.379705,0.718525,0.436302,0.664322,0.701431,0.020327,0.252069,...,0.980789,0.044621,0.992705,0.259897,0.084582,0.243645,0.689775,0.800428,0.592181,0.645009
3,0.900926,0.184234,0.829313,0.308187,0.606627,0.843427,0.005819,0.109759,0.708196,0.353775,...,0.972832,0.947831,0.293949,0.692866,0.022090,0.234674,0.834706,0.490700,0.171373,0.076085
4,0.024145,0.526038,0.970934,0.583943,0.120785,0.547093,0.270786,0.608488,0.549435,0.564809,...,0.113354,0.559431,0.971124,0.703915,0.813644,0.218915,0.568817,0.375038,0.884978,0.206765

Sort the dataframe upside down

In [27]:
newdf.sort_index(axis=0, ascending=False).head()  # axis=0 : Row, axis=1 : column

            0         1         2         3         4
333  0.158583  0.924595  0.645009  0.076085  0.206765
332  0.469531  0.291094  0.592181  0.171373  0.884978
331  0.493320  0.922792  0.800428  0.490700  0.375038
330  0.682081  0.923336  0.689775  0.834706  0.568817
329  0.460582  0.068399  0.243645  0.234674  0.218915

In [28]:
newdf[0]

0      0.631012
1      0.550210
2      0.121892
3      0.930691
4      0.298736
         ...
329    0.460582
330    0.682081
331    0.493320
332    0.469531
333    0.158583
Name: 0, Length: 334, dtype: float64

In [29]:
newdf2 = newdf.copy()

In [30]:
newdf2[0][0] = 97835

In [31]:
newdf.head()

          0         1         2         3         4
0  0.631012  0.851450  0.285129  0.900926  0.024145
1  0.550210  0.629512  0.236064  0.184234  0.526038
2  0.121892  0.382033  0.727544  0.829313  0.970934
3  0.930691  0.826131  0.379705  0.308187  0.583943
4  0.298736  0.347746  0.718525  0.606627  0.120785

In [32]:
newdf2.head()

              0         1         2         3         4
0  97835.000000  0.851450  0.285129  0.900926  0.024145
1      0.550210  0.629512  0.236064  0.184234  0.526038
2      0.121892  0.382033  0.727544  0.829313  0.970934
3      0.930691  0.826131  0.379705  0.308187  0.583943
4      0.298736  0.347746  0.718525  0.606627  0.120785

In [33]:
newdf.columns = list("ABCDE") # To change the naming of the columns

In [34]:
newdf.head(2)

          A         B         C         D         E
0  0.631012  0.851450  0.285129  0.900926  0.024145
1  0.550210  0.629512  0.236064  0.184234  0.526038

In [46]:
newdf.loc[0, 'A'] = 65445

In [47]:
newdf.loc[0, 0] = 65445

In [48]:
newdf.head()

              A         B         C         D         E        0
0  65445.000000  0.851450  0.285129  0.900926  0.024145  65445.0
1      0.550210  0.629512  0.236064  0.184234  0.526038      NaN
2      0.121892  0.382033  0.727544  0.829313  0.970934      NaN
3      0.930691  0.826131  0.379705  0.308187  0.583943      NaN
4      0.298736  0.347746  0.718525  0.606627  0.120785      NaN

In [49]:
newdf = newdf.drop(0, axis=1) # To drop a column (axis=1) , to drop a row (axis=0)

In [50]:
newdf.head()

              A         B         C         D         E
0  65445.000000  0.851450  0.285129  0.900926  0.024145
1      0.550210  0.629512  0.236064  0.184234  0.526038
2      0.121892  0.382033  0.727544  0.829313  0.970934
3      0.930691  0.826131  0.379705  0.308187  0.583943
4      0.298736  0.347746  0.718525  0.606627  0.120785

In [51]:
newdf.loc[[1,2], ['C', 'D']]

          C         D
1  0.236064  0.184234
2  0.727544  0.829313

In [52]:
newdf.head()

              A         B         C         D         E
0  65445.000000  0.851450  0.285129  0.900926  0.024145
1      0.550210  0.629512  0.236064  0.184234  0.526038
2      0.121892  0.382033  0.727544  0.829313  0.970934
3      0.930691  0.826131  0.379705  0.308187  0.583943
4      0.298736  0.347746  0.718525  0.606627  0.120785

In [53]:
newdf.loc[[1,2], :]

          A         B         C         D         E
1  0.550210  0.629512  0.236064  0.184234  0.526038
2  0.121892  0.382033  0.727544  0.829313  0.970934

In [55]:
newdf.loc[(newdf['A']<0.3)] # Applying a condition

            A         B         C         D         E
2    0.121892  0.382033  0.727544  0.829313  0.970934
4    0.298736  0.347746  0.718525  0.606627  0.120785
6    0.082162  0.905739  0.664322  0.005819  0.270786
9    0.133871  0.628800  0.252069  0.353775  0.564809
10   0.276264  0.086326  0.819828  0.122013  0.724442
..        ...       ...       ...       ...       ...
321  0.000624  0.863010  0.920674  0.257991  0.799389
323  0.253140  0.189934  0.946112  0.869145  0.270839
324  0.226857  0.454521  0.980789  0.972832  0.113354
326  0.121785  0.898896  0.992705  0.293949  0.971124
333  0.158583  0.924595  0.645009  0.076085  0.206765

[99 rows x 5 columns]

In [56]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
2    0.121892  0.382033  0.727544  0.829313  0.970934
4    0.298736  0.347746  0.718525  0.606627  0.120785
6    0.082162  0.905739  0.664322  0.005819  0.270786
9    0.133871  0.628800  0.252069  0.353775  0.564809
10   0.276264  0.086326  0.819828  0.122013  0.724442
..        ...       ...       ...       ...       ...
321  0.000624  0.863010  0.920674  0.257991  0.799389
323  0.253140  0.189934  0.946112  0.869145  0.270839
324  0.226857  0.454521  0.980789  0.972832  0.113354
326  0.121785  0.898896  0.992705  0.293949  0.971124
333  0.158583  0.924595  0.645009  0.076085  0.206765

[89 rows x 5 columns]

In [60]:
newdf.iloc[0,4] # iloc is used to show to conyent of the specific cell (if you don't want to use names)

0.024145386504727195

In [61]:
newdf.iloc[[0,5], [1,2]]

          B         C
0  0.851450  0.285129
5  0.666547  0.436302

In [69]:
newdf.head()

          B         C         E
0  0.851450  0.285129  0.024145
1  0.629512  0.236064  0.526038
2  0.382033  0.727544  0.970934
3  0.826131  0.379705  0.583943
4  0.347746  0.718525  0.120785

In [70]:
# newdf.drop(['A', 'D'], axis=1, inplace=True) # inplace is used to update the data base with current chages

In [71]:
newdf

            B         C         E
0    0.851450  0.285129  0.024145
1    0.629512  0.236064  0.526038
2    0.382033  0.727544  0.970934
3    0.826131  0.379705  0.583943
4    0.347746  0.718525  0.120785
..        ...       ...       ...
329  0.068399  0.243645  0.218915
330  0.923336  0.689775  0.568817
331  0.922792  0.800428  0.375038
332  0.291094  0.592181  0.884978
333  0.924595  0.645009  0.206765

[334 rows x 3 columns]

In [75]:
newdf.reset_index(drop=True,inplace= True)

In [76]:
newdf.head()

          B         C         E
0  0.851450  0.285129  0.024145
1  0.629512  0.236064  0.526038
2  0.382033  0.727544  0.970934
3  0.826131  0.379705  0.583943
4  0.347746  0.718525  0.120785